import React from "react";
import { Routes, Route, Link } from "react-router-dom";

// App.js
function Home() {
  return (
    <>
      <main>
        <h2>صفحه اصلی</h2>
        <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
      </main>
      <nav>
        <Link to="/about">درباره ما</Link>
      </nav>
    </>
  );
}

function About() {
  return (
    <>
      <main>
        <h2>درباره ما</h2>
        <p>
        پس از انجام ساخت آنلاین لورم ایپسوم مورد نیاز خود، می توانید نظرات، پیشنهادات و انتقادات خود را در دیدگاه ساخت آنلاین لورم ایپسوم با ما به اشتراک بگذارید.
        </p>
      </main>
      <nav>
        <Link to="/">صفحه اصلی</Link>
      </nav>
    </>
  );}

function Rrd() {
  return (
    <div className="App">
      <h1>خوش آمدید به ریکت</h1>
      <Routes>
        <Route path="/" element={<Home />} />
        <Route path="about" element={<About />} />
      </Routes>
    </div>
  );
}
export default Rrd;